# Pandas'a Giriş (Pandas Nedir)

#series oluşturma

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\kulme\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (1.5.3)

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: C:\Users\kulme\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\kulme\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\kulme\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (1.24.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\kulme\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2022.7.1)
Requirement already satisfied: six>=1.5 in c:\users\kulme\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd # import pandas yeterli ama biz pd ullanacağız

In [3]:
my_deta = ["metehan" , "emre", "ayşe" , "emine", "şükür"]
my_deta

['metehan', 'emre', 'ayşe', 'emine', 'şükür']

In [4]:
pd.Series(my_deta)

0    metehan
1       emre
2       ayşe
3      emine
4      şükür
dtype: object

In [5]:
ülkeler = [1923 , 1776 , 1853]
my_idx = ["türkiye" , "usa" , "canada"]

In [6]:
ülkeler

[1923, 1776, 1853]

In [7]:
my_idx

['türkiye', 'usa', 'canada']

In [8]:
pd.Series(ülkeler, my_idx)

türkiye    1923
usa        1776
canada     1853
dtype: int64

In [9]:
pd.Series(data= ülkeler , index= my_idx)

türkiye    1923
usa        1776
canada     1853
dtype: int64

In [10]:
# pd.Series() içine dikşinery de alabilir. keyler inex value değer olur

In [11]:
my_dict = {
    "metehan" : 22, 
    "şükür" : 23,
    "emre" : 21,
    "ali" : 15
}

In [12]:
my_dict

{'metehan': 22, 'şükür': 23, 'emre': 21, 'ali': 15}

In [13]:
pd.Series(data = my_dict)

metehan    22
şükür      23
emre       21
ali        15
dtype: int64

In [14]:
soru = [ "istabul", "ankara" , "izmir" , "bursa"]
deger = [15.4,5.6,4.3,3]

In [15]:
pd.Series(deger,soru)

istabul    15.4
ankara      5.6
izmir       4.3
bursa       3.0
dtype: float64

In [16]:
soru_dict = {
    "istanbul" : 15.4,
    "ankara" : 5.6,
    "izmir" : 4.3,
    "bursa" : 3
}

In [17]:
pd.Series(soru_dict)

istanbul    15.4
ankara       5.6
izmir        4.3
bursa        3.0
dtype: float64

# serilerde işlemler

In [19]:
q1 = {"Japan":80, "China": 450, "Turkey": 150, "India": 200}
q2 = {"Brazil":90, "China": 420, "Turkey": 230, "India": 195}

In [21]:
sales_q1 = pd.Series(q1)
sales_q2 = pd.Series(q2)

In [22]:
sales_q1 + sales_q2

Brazil      NaN
China     870.0
India     395.0
Japan       NaN
Turkey    380.0
dtype: float64

In [27]:
sales_q1.add(sales_q2, fill_value= 0) #.add() toplama parametresidir. fill_value ile birlikte bilinmeyen deeri 0 olarak düşündü.

Brazil     90.0
China     870.0
India     395.0
Japan      80.0
Turkey    380.0
dtype: float64

In [28]:
sales_q1

Japan      80
China     450
Turkey    150
India     200
dtype: int64

In [31]:
sales_q1.dtype # .dtype ile tipine bakmış olacağız

dtype('int64')

In [ ]:
# Soru : 
# Fenerbahce 51 , Galatasaray 60 , Besiktas 48 , Trabzonspor 41 şeklinde league_2022 adında bir seri oluşturun.
# Fenerbahce 73 , Galatasaray 68 , Besiktas 59 , Trabzonspor 81 şeklinde league_2021 adında bir seri oluşturun.
# Fenerbahce 82 , Galatasaray 84 , Besiktas 84 , Trabzonspor 71 şeklinde league_2020 adında bir seri oluşturun.

In [42]:
lig1 = {"Fenerbahce": 82 , "Galatasaray": 84 , "Besiktas": 84 , "Trabzonspor": 71}
lig2 = {"Fenerbahce": 73 , "Galatasaray": 68 , "Besiktas": 59 , "Trabzonspor": 81}
lig3 = {"Fenerbahce": 51 , "Galatasaray": 60 , "Besiktas": 48 , "Trabzonspor": 41}

In [46]:
toplam_maçlar1 = pd.Series(lig1)
toplam_maçlar2= pd.Series(lig2)
toplam_maçlar3 = pd.Series(lig3)

In [50]:
toplam_puanlar = toplam_maçlar1 + toplam_maçlar2 + toplam_maçlar3
toplam_puanlar

Fenerbahce     206
Galatasaray    212
Besiktas       191
Trabzonspor    193
dtype: int64

# DataFrame

In [52]:
import numpy as np

In [60]:
my_data1 = np.random.randint(0,101 , size= (5,4))
my_data1

array([[25, 51, 79, 72],
       [99,  0,  9,  6],
       [88, 23, 52, 43],
       [28, 71, 43, 31],
       [68,  1, 92,  1]])

In [61]:
pd.DataFrame(my_data1)

    0   1   2   3
0  25  51  79  72
1  99   0   9   6
2  88  23  52  43
3  28  71  43  31
4  68   1  92   1

In [74]:
my_indx = ["tr" , "br" , "usa" , "ru"]
my_cols = ["jen" ,"feb", "mar"]
my_data = np.random.randint(0,101,size= (4,3))

In [77]:
df = pd.DataFrame(data = my_data , index = my_indx , columns= my_cols)
df

     jen  feb  mar
tr    25   96   89
br    22   59   93
usa    4   39   15
ru    94   62   39

In [83]:
df.columns

Index(['jen', 'feb', 'mar'], dtype='object')

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, tr to ru
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   jen     4 non-null      int32
 1   feb     4 non-null      int32
 2   mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

# hazır bir data çağırmak

In [86]:
!pwd

'pwd' is not recognized as an internal or external command,
operable program or batch file.

In [90]:
pd.read_csv("tips.csv")

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672